#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <stdio.h>

int main(){

    int fd, result;
    size_t size;
    char resstring[14];
    char name[]="aaa.fifo";

/* Îáíóëÿåì ìàñêó ñîçäàíèÿ ôàéëîâ òåêóùåãî ïðîöåññà äëÿ òîãî, ÷òîáû
ïðàâà äîñòóïà ó ñîçäàâàåìîãî FIFO òî÷íî ñîîòâåñòâîâàëè ïàðàìåòðó âûçîâà mknod() */

    (void)umask(0);

/* Ïîïûòàåìñÿ ñîçäàòü FIFO ñ èìåíåì  aaa.fifo â òåêóùåé äèðåêòîðèè */

    if(mknod(name, S_IFIFO | 0666, 0) < 0){

/* Åñëè ñîçäàòü FIFO íå óäàëîñü, ïå÷àòàåì îá ýòîì ñîîáùåíèå è ïðåêðàùàåì ðàáîòó */

        printf("Can\'t create FIFO\n");
        exit(-1);
    }

/* Ïîðîæäàåì íîâûé ïðîöåññ */

    if((result = fork()) < 0){

/* Åñëè ñîçäàòü ïðîöåññ íå óäàëîñü, ñîîáùàåì îá ýòîì è çàâåðøàåì ðàáîòó */

        printf("Can\'t fork child\n");
        exit(-1);

    } else if (result > 0) {

/* Ìû íàõîäèìñÿ â ðîäèòåëüñêîì ïðîöåññå, êîòîðûé áóäåò ïåðåäàâàòü èíôîðìàöèþ ïðîöåññó-ðåáåíêó . Â ýòîì ïðîöåññå îòêðûâàåì FIFO íà çàïèñü.*/

        if((fd = open(name, O_WRONLY)) < 0){

/* Åñëè îòêðûòü FIFO íå óäàëîñü, ïå÷àòàåì îá ýòîì ñîîáùåíèå è ïðåêðàùàåì ðàáîòó */

            printf("Can\'t open FIFO for writting\n");
            exit(-1);
        }

/* Ïðîáóåì çàïèñàòü â FIFO 14 áàéò, ò.å. âñþ ñòðîêó "Hello, world!"
âìåñòå ñ ïðèçíàêîì êîíöà ñòðîêè */

        size = write(fd, "Hello, world!", 14);

        if(size != 14){

/* Åñëè çàïèñàëîñü ìåíüøåå êîëè÷åñòâî áàéò, ñîîáùàåì îá îøèáêå è çàâåðøàåì ðàáîòó */

            printf("Can\'t write all string to FIFO\n");
            exit(-1);
        }

/* Çàêðûâàåì âõîäíîé ïîòîê äàííûõ è íà ýòîì ðîäèòåëü ïðåêðàùàåò ðàáîòó */

        close(fd);
        printf("Parent exit\n");

    } else {

/* Ìû íàõîäèìñÿ â ïîðîæäåííîì ïðîöåññå, êîòîðûé áóäåò ïîëó÷àòü èíôîðìàöèþ îò ïðîöåññà-ðîäèòåëÿ. Îòêðûâàåì FIFO íà ÷òåíèå.*/

        if((fd = open(name, O_RDONLY)) < 0){

/* Åñëè îòêðûòü FIFO íå óäàëîñü, ïå÷àòàåì îá ýòîì ñîîáùåíèå è ïðåêðàùàåì ðàáîòó */

            printf("Can\'t open FIFO for reading\n");
            exit(-1);
        }

/* Ïðîáóåì ïðî÷èòàòü èç FIFO 14 áàéò â ìàññèâ, ò.å. âñþ çàïèñàííóþ ñòðîêó */

        size = read(fd, resstring, 14);

        if(size < 0){

/* Åñëè ïðî÷èòàòü íå ñìîãëè, ñîîáùàåì îá îøèáêå è çàâåðøàåì ðàáîòó */

            printf("Can\'t read string\n");
            exit(-1);
        }

/* Ïå÷àòàåì ïðî÷èòàííóþ ñòðîêó */

        printf("%s\n",resstring);

/* Çàêðûâàåì âõîäíîé ïîòîê è çàâåðøàåì ðàáîòó */

        close(fd);

    }

    return 0;
}