#include <sys/types.h>
#include <sys/ipc.h>
#include <sys/shm.h>
#include <stdio.h>
#include <errno.h>
#include <stdlib.h>

int main() {

    int *array; /* Óêàçàòåëü íà ðàçäåëÿåìóþ ïàìÿòü */

    int shmid; /* IPC äåñêðèïòîð äëÿ îáëàñòè ðàçäåëÿåìîé ïàìÿòè */

    int new = 1; /* Ôëàã íåîáõîäèìîñòè èíèöèàëèçàöèè ýëåìåíòîâ ìàññèâà */

    char pathname[] = "myfile"; /* Èìÿ ôàéëà, èñïîëüçóþùååñÿ äëÿ ãåíåðàöèè êëþ÷à. Ôàéë ñ òàêèì èìåíåì äîëæåí ñóùåñòâîâàòü â òåêóùåé äèðåêòîðèè */

    key_t key; /* IPC êëþ÷ */


/* Ãåíåðèðóåì IPC êëþ÷ èç èìåíè ôàéëà 06-1a.c â òåêóùåé äèðåêòîðèè è íîìåðà ýêçåìïëÿðà îáëàñòè ðàçäåëÿåìîé ïàìÿòè 0 */

    if ((key = ftok(pathname, 0)) < 0) {
        printf("Can\'t generate key\n");
        exit(-1);
    }

/* Ïûòàåìñÿ ýêñêëþçèâíî ñîçäàòü ðàçäåëÿåìóþ ïàìÿòü äëÿ ñãåíåðèðîâàííîãî êëþ÷à, ò.å. åñëè äëÿ ýòîãî êëþ÷à îíà óæå ñóùåñòâóåò ñèñòåìíûé âûçîâ âåðíåò îòðèöàòåëüíîå çíà÷åíèå. Ðàçìåð ïàìÿòè îïðåäåëÿåì êàê ðàçìåð ìàññèâà èç 3-õ öåëûõ ïåðåìåííûõ, ïðàâà äîñòóïà 0666 - ÷òåíèå è çàïèñü ðàçðåøåíû äëÿ âñåõ */

    if ((shmid = shmget(key, 3 * sizeof(int), 0666 | IPC_CREAT | IPC_EXCL)) < 0) {


/* Â ñëó÷àå âîçíèêíîâåíèÿ îøèáêè ïûòàåìñÿ îïðåäåëèòü: âîçíèêëà ëè îíà èç-çà òîãî, ÷òî ñåãìåíò ðàçäåëÿåìîé ïàìÿòè óæå ñóùåñòâóåò èëè ïî äðóãîé ïðè÷èíå */

        if (errno != EEXIST) {

/* Åñëè ïî äðóãîé ïðè÷èíå - ïðåêðàùàåì ðàáîòó */

            printf("Can\'t create shared memory\n");
            exit(-1);
        } else {

/* Åñëè èç-çà òîãî, ÷òî ðàçäåëÿåìàÿ ïàìÿòü óæå ñóùåñòâóåò ïûòàåìñÿ ïîëó÷èòü åå IPC äåñêðèïòîð è, â ñëó÷àå óäà÷è, ñáðàñûâàåì ôëàã íåîáõîäèìîñòè èíèöèàëèçàöèè ýëåìåíòîâ ìàññèâà */

            if ((shmid = shmget(key, 3 * sizeof(int), 0)) < 0) {
                printf("Can\'t find shared memory\n");
                exit(-1);
            }
            new = 0;
        }
    }


/* Ïûòàåìñÿ îòîáðàçèòü ðàçäåëÿåìóþ ïàìÿòü â àäðåñíîå ïðîñòðàíñòâî òåêóùåãî ïðîöåññà. Îáðàòèòå âíèìàíèå íà òî, ÷òî äëÿ ïðàâèëüíîãî ñðàâíåíèÿ ìû ÿâíî ïðåîáðàçîâûâàåì çíà÷åíèå -1 ê óêàçàòåëþ íà öåëîå.*/

    if ((array = (int *) shmat(shmid, NULL, 0)) == (int *) (-1)) {
        printf("Can't attach shared memory\n");
        exit(-1);
    }


/* Â çàâèñèìîñòè îò çíà÷åíèÿ ôëàãà new ëèáî èíèöèàëèçèðóåì ìàññèâ, ëèáî óâåëè÷èâàåì ñîîòâåòñòâóþùèå ñ÷åò÷èêè */

    if (new) {
        array[0] = 1;
        array[1] = 0;
        array[2] = 1;
    } else {
        array[0] += 1;
        array[2] += 1;
    }


/* Ïå÷àòàåì íîâûå çíà÷åíèÿ ñ÷åò÷èêîâ, óäàëÿåì ðàçäåëÿåìóþ ïàìÿòü èç àäðåñíîãî ïðîñòðàíñòâà òåêóùåãî ïðîöåññà è çàâåðøàåì ðàáîòó */

    printf("Program 1 was spawn %d times, program 2 - %d times, total - %d times\n",
           array[0], array[1], array[2]);

    if (shmdt(array) < 0) {
        printf("Can't detach shared memory\n");
        exit(-1);
    }
    return 0;
}
